# Assignment-3

# Project name : Body Mass Index Predictor

## Import Package

In [1]:
import pandas as pd
import numpy as np  
import matplotlib.pyplot as plt

## Load The data

In [2]:
data= pd.read_csv('dataset_500_Person_Gender_Height_Weight_Index.csv')

## Data Understanding

### Top 5 rows

In [3]:
data.head(5)

   Gender  Height  Weight  Index
0    Male     174      96      4
1    Male     189      87      2
2  Female     185     110      4
3  Female     195     104      3
4    Male     149      61      3

### Bottom 5 rows

In [4]:
data.tail(5)

     Gender  Height  Weight  Index
495  Female     150     153      5
496  Female     184     121      4
497  Female     141     136      5
498    Male     150      95      5
499    Male     173     131      5

## Shape of data

In [5]:
data.shape

(500, 4)

### There are total 500 rows and 4 attributes

In [6]:
data.columns

Index(['Gender', 'Height', 'Weight', 'Index'], dtype='object')

In [7]:
type(data)

pandas.core.frame.DataFrame

# Describe data

In [8]:
data.describe()

           Height      Weight       Index
count  500.000000  500.000000  500.000000
mean   169.944000  106.000000    3.748000
std     16.375261   32.382607    1.355053
min    140.000000   50.000000    0.000000
25%    156.000000   80.000000    3.000000
50%    170.500000  106.000000    4.000000
75%    184.000000  136.000000    5.000000
max    199.000000  160.000000    5.000000

In [9]:
data.dtypes

Gender    object
Height     int64
Weight     int64
Index      int64
dtype: object

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 4 columns):
Gender    500 non-null object
Height    500 non-null int64
Weight    500 non-null int64
Index     500 non-null int64
dtypes: int64(3), object(1)
memory usage: 15.8+ KB

In [11]:
data.get_dtype_counts()

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: `get_dtype_counts` has been deprecated and will be removed in a future version. For DataFrames use `.dtypes.value_counts()
  """Entry point for launching an IPython kernel.

int64     3
object    1
dtype: int64

In [12]:
data.count()

Gender    500
Height    500
Weight    500
Index     500
dtype: int64

# Remove Insignificant columns

In [13]:
# There is no insignificant columns in Dataset

# Check Missing value for each columns

In [14]:
data.isnull()

     Gender  Height  Weight  Index
0     False   False   False  False
1     False   False   False  False
2     False   False   False  False
3     False   False   False  False
4     False   False   False  False
..      ...     ...     ...    ...
495   False   False   False  False
496   False   False   False  False
497   False   False   False  False
498   False   False   False  False
499   False   False   False  False

[500 rows x 4 columns]

In [15]:
data=data.dropna()
data

     Gender  Height  Weight  Index
0      Male     174      96      4
1      Male     189      87      2
2    Female     185     110      4
3    Female     195     104      3
4      Male     149      61      3
..      ...     ...     ...    ...
495  Female     150     153      5
496  Female     184     121      4
497  Female     141     136      5
498    Male     150      95      5
499    Male     173     131      5

[500 rows x 4 columns]

In [16]:
data.isnull().sum()

Gender    0
Height    0
Weight    0
Index     0
dtype: int64

In [17]:
data['Height'].isnull().sum()

0

In [18]:
data['Weight'].isnull().sum()

0

# Formatting Data

In [19]:
modified_data = data.dropna()

In [20]:
modified_data.isnull().sum()

Gender    0
Height    0
Weight    0
Index     0
dtype: int64

In [21]:
modified_data.to_csv('modified_data.csv',index=False)

In [22]:
modified_data['Weight'].mean()

106.0

In [25]:
modified_data['Height'].mean()

169.944

In [27]:
data.to_pickle('modified_data.csv')

In [29]:
r=pd.read_pickle('vmodified_data.csv')

In [30]:
r.head()

   Gender  Height  Weight  Index
0    Male     174      96      4
1    Male     189      87      2
2  Female     185     110      4
3  Female     195     104      3
4    Male     149      61      3

In [31]:
r.tail()

     Gender  Height  Weight  Index
495  Female     150     153      5
496  Female     184     121      4
497  Female     141     136      5
498    Male     150      95      5
499    Male     173     131      5

In [ ]:
xls=pd.read_excel('modified_data.xlsx')

In [33]:
xls.head()

   Gender  Height  Weight  Index
0    Male     174      96      4
1    Male     189      87      2
2  Female     185     110      4
3  Female     195     104      3
4    Male     149      61      3